In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

## Удаление столбцов и строк. Отсутствующие значения.

In [3]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, np.nan]})
df

   A  B    C
0  1  4  7.0
1  2  5  8.0
2  3  6  NaN

Проверка на NaN-ы:

In [3]:
df.isna()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False   True

In [4]:
df.isna().sum()

A    0
B    0
C    1
dtype: int64

Удалять строки и столбцы с пустыми значениями можно с помощию функции `dropna`. Обратите внимание, что применение функции без присваивания создает новый объект, а не меняет *df*.

In [5]:
df.dropna()

   A  B    C
0  1  4  7.0
1  2  5  8.0

In [6]:
df

   A  B    C
0  1  4  7.0
1  2  5  8.0
2  3  6  NaN

Как и у многих других функций библиотек `numpy` и `pandas` есть аргумент `axis`, который отвечает за выбор: просмотр строк или просмотр столбцов:

In [7]:
df.dropna(axis = 0)

   A  B    C
0  1  4  7.0
1  2  5  8.0

In [8]:
df.dropna(axis = 1)

   A  B
0  1  4
1  2  5
2  3  6

Пропущенные значения можно не только удалить, но и заполнить:

In [9]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

Заполнить можно значением:

In [11]:
df.fillna(value=0)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

Словарем значений:

In [12]:
values = {"A": 0, "B": 1, "C": 2, "D": 3}
df.fillna(value=values)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

Методом заполнения вперед:

In [13]:
df.fillna(method="ffill")

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  4.0 NaN  1.0
3  3.0  3.0 NaN  4.0

Методом заполенения назад:

In [14]:
df.fillna(method="bfill")

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  3.0 NaN  4.0
3  NaN  3.0 NaN  4.0

И, конечно, нужно уметь удалять ненужные столбцы. Для этого есть функция `drop`. Здесь мы уже не обращаем внимание на наличие или отсутствие пустых значений. Параметрами подаются список названий колонок для удаления, и часто указывается `axis=1`, т.к. по умолчанию считается axis=0, в этом случае поиск будет по индексам строк.

In [15]:
df.drop(["C"], axis = 1)

     A    B    D
0  NaN  2.0  0.0
1  3.0  4.0  1.0
2  NaN  NaN  NaN
3  NaN  3.0  4.0

In [16]:
df.fillna(method="bfill").drop(["A", "C"], axis = 1)

     B    D
0  2.0  0.0
1  4.0  1.0
2  3.0  4.0
3  3.0  4.0

Функция `drop` также не изменяет исходный объект, а создает новый. Для изменения исходного объекта нужно присвоить ему этот результат:

In [17]:
df = df.fillna(method="bfill").drop(["A", "C"], axis = 1)

In [18]:
df

     B    D
0  2.0  0.0
1  4.0  1.0
2  3.0  4.0
3  3.0  4.0

Еще пара способов:

In [19]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [20]:
df.mean()

A    3.000000
B    3.000000
C         NaN
D    1.666667
dtype: float64

In [21]:
df.fillna(df.mean())

     A    B   C         D
0  3.0  2.0 NaN  0.000000
1  3.0  4.0 NaN  1.000000
2  3.0  3.0 NaN  1.666667
3  3.0  3.0 NaN  4.000000

In [22]:
df.fillna(df.min())

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  2.0 NaN  0.0
3  3.0  3.0 NaN  4.0

In [23]:
df.fillna(df.min()).fillna(df.max().min())

     A    B    C    D
0  3.0  2.0  3.0  0.0
1  3.0  4.0  3.0  1.0
2  3.0  2.0  3.0  0.0
3  3.0  3.0  3.0  4.0

**Упражнение 1.** Объясните, как работает ячейка выше.

**Упражнение 2.** Дан датафрейм в ячейке ниже, состоящий из 4 единиц на диагонали и nan-ов. Заполнить его так, чтобы в нем было 8 единиц и 8 двоек. Использовать только `fillna`.

In [4]:
df = pd.DataFrame([[1, np.nan, np.nan, np.nan],
                   [np.nan, 1, np.nan, np.nan],
                   [np.nan, np.nan, 1, np.nan],
                   [np.nan, np.nan, np.nan, 1]],
                columns=list("ABCD"))
df[['A', 'C']] = df[['A', 'C']].fillna(method='ffill')
df = df.fillna(2)
df

     A    B    C    D
0  1.0  2.0  2.0  2.0
1  1.0  1.0  2.0  2.0
2  1.0  2.0  1.0  2.0
3  1.0  2.0  1.0  1.0

**Упражнение 3.** Из полученного датафрейма удалить столбец (или столбцы) с минимальной суммой значений.

In [ ]:
a = df.nunique().max()
while df.nunique().max() == a:
    df = df.drop(columns=[df.nunique().idxmax()])
df

## Еще работа с данными. Пассажиры Титаника.

In [10]:
df = pd.read_csv('train.csv') #поменять путь на актуальный для вас

In [35]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [36]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [37]:
df.shape

(891, 12)

**Упражнение 4.** Найдите средний возраст пассажиров

In [7]:
df[['Age']].mean()

Age    29.699118
dtype: float64

**Упражнение 5.** Выведите имя самого молодого пассажира.

In [8]:
df['Name'][df['Age'].argmin()]

'Thomas, Master. Assad Alexander'

**Упражнение 6.** Посчитайте доли пассажиров по классам обслуживания (Pclass)

In [14]:
a = int(df.shape[0])
print('1 класс', df[df.Pclass == 1].shape[0] / a)
print('2 класс', df[df.Pclass == 2].shape[0] / a)
print('3 класс', df[df.Pclass == 3].shape[0] / a)

1 класс 0.24242424242424243
2 класс 0.20650953984287318
3 класс 0.5510662177328844

**Упражнение 7.** Найдите средние возраста пассажиров по классам обслуживания.

In [15]:
df[["Pclass", "Age"]].groupby(["Pclass"]).mean()

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

**Упражнение 8.** Удалите столбец с наибольшим числом пропусков.

In [16]:
df = df.drop(columns=[df.isna().sum().idxmax()])
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

**Упражнение 9.** Удалите столбцы с наибольшим числом уникальных значений.

In [17]:
df = pd.read_csv('train.csv')
a = df.nunique().max()
while df.nunique().max() == a:
    df = df.drop(columns=[df.nunique().idxmax()])
df

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

**Упражнение 10.** Найдите доли выживших среди мужчин, среди женщин и среди всех пассажиров.

In [20]:
df = pd.read_csv('train.csv')
a = df[['Sex', 'Survived']].groupby(['Sex']).sum()
a.iloc[0, 0] = a.iloc[0, 0] / df[df['Sex'] == 'female'].shape[0]
a.iloc[1, 0] = a.iloc[1, 0] / df[df['Sex'] == 'male'].shape[0]
a

        Survived
Sex
female  0.742038
male    0.188908

**Упражнение 11.** Найдите доли выживших по классам обслуживания.

In [21]:
df = pd.read_csv('train.csv')
a = df[['Pclass', 'Survived']].groupby(['Pclass']).sum()
a.iloc[0, 0] = a.iloc[0, 0] / df[df['Pclass'] == 1].shape[0]
a.iloc[1, 0] = a.iloc[1, 0] / df[df['Pclass'] == 2].shape[0]
a.iloc[2, 0] = a.iloc[2, 0] / df[df['Pclass'] == 3].shape[0]
a

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

**Упражнение 12.** Найдите доли выживших среди возрастных категорий 18-, 18-60, 60+.

In [22]:
df = pd.read_csv('train.csv')
a = df[['Age', 'Survived']]
b = a[a['Age'] < 18]
print('18-:', b[b['Survived'] == 1].sum()[1]/b.shape[0])
b = a[(a['Age'] >= 18) & (a['Age'] < 60)]
print('18-60:', b[b['Survived'] == 1].sum()[1]/b.shape[0])
b = a[a['Age'] >= 60]
print('60+:', b[b['Survived'] == 1].sum()[1]/b.shape[0])

18-: 0.5398230088495575
18-60: 0.38608695652173913
60+: 0.2692307692307692